It-academy/Documents/ВозвратОдежды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВозвратОдежды</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Основной</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УНП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

It-academy/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Cклады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

It-academy/AccountingRegisters/Основной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Основной</Name>
			<ChartOfAccounts>ChartOfAccounts.Основной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Основной.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Основной.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Основной.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

It-academy/AccumulationRegisters/СтоимостьТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>СтоимостьТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

It-academy/Enums/ВидНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

It-academy/Documents/ВозвратОдежды/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.Основной.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	
	//Установим блокировки данных в регистрах
	Движения.Основной.БлокироватьДляИзменения = Истина;
	Движения.ТоварыНаСкладах.БлокироватьДляИзменения = Истина;	
	Движения.СтоимостьТоваров.БлокироватьДляИзменения = Истина;
	
	//для правильного получения средней стоимости
	Движения.Основной.Записать();
	Движения.ТоварыНаСкладах.Записать();
	Движения.СтоимостьТоваров.Записать();
	
	РезультатТовары = ПолучитьВыборкуТоваров();  
    ТекстрокаТовары = РезультатТовары.Выбрать();
      
    // регистр ТоварыНаСкладах Приход
    //Для Каждого ТекСтрокаТовары Из Товары Цикл   
    Пока ТекСтрокаТовары.Следующий()Цикл
        Движение = Движения.ТоварыНаСкладах.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
		Движение.Склад = Справочники.Cклады.ЦентральныйСклад;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		// регистр СтоимостьТоваров Приход
		Движение = Движения.СтоимостьТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Стоимость = ТекСтрокаТовары.Стоимость * ТекСтрокаТовары.Количество;
		
		// регистр Основной 
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ТекСтрокаТовары.СчетДт; 
		Движение.СчетКт = ТекСтрокаТовары.СчетКт;
		Движение.КоличествоДт = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		
		Движение.СубконтоДт.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.СубконтоДт.Склады = Склад;
		
		Движение.СубконтоКт.Контрагенты = Контрагент;
		Движение.СубконтоКт.Договоры = Договор;
		
	КонецЦикла;
		Движения.Записать();
		
		СписокНоменклатур = РезультатТовары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		Если Не РаботаСДокументамиСервер.ПроверкаОстатковТоваров(Дата, Склад, СписокНоменклатур) Тогда
			Отказ = Истина;
		КонецЕсли;
		
КонецПроцедуры               

Функция ПолучитьВыборкуТоваров()   
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    Таблица.Номенклатура КАК Номенклатура,
        |    Таблица.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
        |    ВЫБОР
        |        КОГДА Таблица.Номенклатура.ВидНоменклатуры
        |                = ЗНАЧЕНИЕ (Перечисление.ВидНоменклатуры.Товар)
        |            ТОГДА ЗНАЧЕНИЕ (ПланСчетов.Основной.Товары)
		|    КОНЕЦ КАК СчетДт,
        |    ВЫБОР
        |        КОГДА Таблица.Номенклатура.ВидНоменклатуры
        |                = ЗНАЧЕНИЕ (Перечисление.ВидНоменклатуры.Товар)
        |            ТОГДА ЗНАЧЕНИЕ (ПланСчетов.Основной.РасчетыСПокупателями)
        |    КОНЕЦ КАК СчетКт,
        |    СУММА(Таблица.Количество) КАК Количество,
        |    СУММА(Таблица.Сумма) КАК Сумма       
        |ИЗ
        |    Документ.ВозвратОдежды.Товары КАК Таблица
        |ГДЕ
        |    Таблица.Ссылка = &Ссылка
        |СГРУППИРОВАТЬ ПО
        |    Таблица.Номенклатура,
        |    Таблица.Номенклатура.ВидНоменклатуры";    
            
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    ТаблицаТоваров = Запрос.Выполнить().Выгрузить();   
    РезультатЗапроса = РаботаСДокументамиСервер.ПолучитьСреднююЦенуДляТаблицыНоменклатур(Дата, ТаблицаТоваров);
 
Возврат РезультатЗапроса;
    
КонецФункции
